aws/amazon-freertos/vendors/cypress/MTB/psoc6/psoc6csp/hal/COMPONENT_PSOC6HAL/source/cyhal_i2s.c
/*******************************************************************************
* File Name: cyhal_i2s.c
*
* Description:
* Provides a high level interface for interacting with the Cypress I2S. This is
* a wrapper around the lower level PDL API.
*
********************************************************************************
* \copyright
* Copyright 2018-2019 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include <math.h>
#include <stdlib.h>
#include "cyhal_i2s.h"
#include "cy_i2s.h"
#include "cyhal_clock.h"
#include "cyhal_gpio.h"
#include "cyhal_hw_resources.h"
#include "cyhal_system_impl.h"
#include "cyhal_hwmgr.h"
#include "cyhal_utils.h"
#include "cyhal_dma.h"
#include "cyhal_syspm.h"
#include "cy_device.h"

/**
* \addtogroup group_hal_psoc6_i2s I2S (Inter-IC Sound)
* \ingroup group_hal_psoc6
* \{
* The PSoC 6 I2S Supports the following values for word and channel lengths (with the constraint that word length must be less than or equal to channel length):
* - 8 bits
* - 16 bits
* - 18 bits
* - 20 bits
* - 24 bits
* - 32 bits
*
* The sclk signal is formed by integer division of the input clock source (either internally provided or from the mclk pin).
* The PSoC 6 I2S supports sclk divider values from 1 to 64.
* \} group_hal_psoc6_i2s
*/


#ifdef CY_IP_MXAUDIOSS

#if defined(__cplusplus)
extern "C"
{
#endif

#define CYHAL_I2S_FIFO_DEPTH (256)
#define CYHAL_I2S_DMA_BURST_SIZE (CYHAL_I2S_FIFO_DEPTH / 2)

static I2S_Type *const cyhal_i2s_base[] =
{
#if (CY_IP_MXAUDIOSS_INSTANCES == 1 && defined(AUDIOSS_I2S) && AUDIOSS_I2S)
    I2S,
#elif (CY_IP_MXAUDIOSS_INSTANCES >= 1 && defined(AUDIOSS0_I2S) && AUDIOSS0_I2S)
    I2S0,
#endif
#if (CY_IP_MXAUDIOSS_INSTANCES >= 2 && defined(AUDIOSS1_I2S) && AUDIOSS1_I2S)
    I2S1,
#endif

#if (CY_IP_MXS40AUDIOSS_INSTANCES > 2)
    #warning Unhandled audioss instance count
#endif
};

static cyhal_i2s_t* cyhal_i2s_config_structs[CY_IP_MXAUDIOSS_INSTANCES];

static const IRQn_Type cyhal_i2s_irq_n[] =
{
#if (CY_IP_MXAUDIOSS_INSTANCES == 1 && defined(AUDIOSS_I2S) && AUDIOSS_I2S) // Without index suffix
    audioss_interrupt_i2s_IRQn,
#elif (CY_IP_MXAUDIOSS_INSTANCES >= 1 && defined(AUDIOSS0_I2S) && AUDIOSS0_I2S)
    audioss_0_interrupt_i2s_IRQn,
#endif
#if (CY_IP_MXAUDIOSS_INSTANCES >= 2 && defined(AUDIOSS1_I2S) && AUDIOSS1_I2S)
    audioss_1_interrupt_i2s_IRQn,
#endif

#if (CY_IP_MXS40AUDIOSS_INSTANCES > 2)
    #warning Unhandled audioss instance count
#endif
};

static uint8_t cyhal_i2s_get_block_from_irqn(IRQn_Type irqn) {
    switch (irqn)
    {
#if (CY_CPU_CORTEX_M4)
#if (CY_IP_MXAUDIOSS_INSTANCES == 1 && defined(AUDIOSS_I2S) && AUDIOSS_I2S) // Without index suffix
    case audioss_interrupt_i2s_IRQn:
        return 0;
#elif (CY_IP_MXAUDIOSS_INSTANCES >= 1 && defined(AUDIOSS0_I2S) && AUDIOSS0_I2S)
    case audioss_0_interrupt_i2s_IRQn:
        return 0;
#endif
#if (CY_IP_MXAUDIOSS_INSTANCES >= 2 && defined(AUDIOSS1_I2S) && AUDIOSS1_I2S)
    case audioss_1_interrupt_i2s_IRQn:
        return 1;
#endif
#if (CY_IP_MXS40AUDIOSS_INSTANCES > 2)
    #warning Unhandled audioss instance count
#endif
#endif /* (CY_CPU_CORTEX_M4) */
    default:
        CY_ASSERT(false); // Should never be called with a non-I2S IRQn
        return 0;
    }
}

static cyhal_i2s_event_t cyhal_i2s_convert_interrupt_cause(uint32_t pdl_cause);
static uint32_t cyhal_i2s_convert_event(cyhal_i2s_event_t event);
static cy_rslt_t cyhal_i2s_convert_length(uint8_t user_length, cy_en_i2s_len_t *pdl_length);
static void cyhal_i2s_irq_handler(void);
static void cyhal_i2s_process_event(cyhal_i2s_t *obj, cyhal_i2s_event_t event);
static void cyhal_i2s_update_enabled_events(cyhal_i2s_t* obj);
static cy_rslt_t cyhal_i2s_dma_perform_rx(cyhal_i2s_t *obj);
static cy_rslt_t cyhal_i2s_dma_perform_tx(cyhal_i2s_t *obj);
static void cyhal_i2s_dma_handler_rx(void *callback_arg, cyhal_dma_event_t event);
static void cyhal_i2s_dma_handler_tx(void *callback_arg, cyhal_dma_event_t event);
static uint8_t cyhal_i2s_rounded_word_length(cyhal_i2s_t *obj);
static bool cyhal_i2s_pm_callback(cyhal_syspm_callback_state_t state, cyhal_syspm_callback_mode_t mode, void* callback_arg);
static cy_rslt_t cyhal_i2s_populate_pdl_config(cyhal_i2s_t *obj, cy_stc_i2s_config_t* pdl_config, uint8_t sclk_div);
static cy_rslt_t cyhal_i2s_compute_sclk_div(cyhal_i2s_t *obj, uint32_t sample_rate_hz, uint8_t *sclk_div);

static const cy_stc_i2s_config_t default_i2s_config = {
    /* tx_enabled and rx_enabled set per-instance */
    .txDmaTrigger = false,
    .rxDmaTrigger = false,
    /* clkDiv set per-instance */
    /* extclk set per-instance */
    /* txMasterMode set per-instance */
    .txAlignment = CY_I2S_I2S_MODE,
    .txWsPulseWidth = CY_I2S_WS_ONE_CHANNEL_LENGTH, /* only supported value for I2S mode */
    .txWatchdogEnable = false,
    .txWatchdogValue = 0u,
    .txSdoLatchingTime = false, /* to match the I2S standard */
    .txSckoInversion = false,
    .txSckiInversion = false,
    .txChannels = 2, /* Only supported value for I2S mode */
    /* txChannelLength set per-instance */
    /* txWordLength set per-instance */
    .txOverheadValue = CY_I2S_OVHDATA_ZERO,
    .txFifoTriggerLevel = CYHAL_I2S_FIFO_DEPTH / 2 + 1, // Trigger at half empty
    /* rxMasterMode set per-instance */
    .rxAlignment = CY_I2S_I2S_MODE,        /**< RX data alignment, see: #cy_en_i2s_alignment_t. */
    .rxWsPulseWidth = CY_I2S_WS_ONE_CHANNEL_LENGTH, /* only supported value for I2S mode */
    .rxWatchdogEnable = false,
    .rxWatchdogValue = 0u,
    .rxSdiLatchingTime = false, /* to match the I2S standard */
    .rxSckoInversion = false,
    .rxSckiInversion = false,
    .rxChannels = 2, /* Only supported value for I2s mode */
    //TODO Dynamic channel length
    /* rxChannelLength set per-instance */
    /* rxWordLength set per-instance */
    .rxSignExtension = false, /* All MSB are filled by zeros */
    .rxFifoTriggerLevel = CYHAL_I2S_FIFO_DEPTH / 2 - 1, // Trigger at half full
};

cy_rslt_t cyhal_i2s_init(cyhal_i2s_t *obj, const cyhal_i2s_pins_t* tx_pins, const cyhal_i2s_pins_t* rx_pins, cyhal_gpio_t mclk,
                         const cyhal_i2s_config_t* config, cyhal_clock_t* clk)
{
    CY_ASSERT(NULL != obj);
    memset(obj, 0, sizeof(cyhal_i2s_t));
    /* Explicitly marked not allocated resources as invalid to prevent freeing them. */
    obj->resource.type = CYHAL_RSC_INVALID;
    obj->pin_tx_sck    = CYHAL_NC_PIN_VALUE;
    obj->pin_tx_ws     = CYHAL_NC_PIN_VALUE;
    obj->pin_tx_sdo    = CYHAL_NC_PIN_VALUE;
    obj->pin_rx_sck    = CYHAL_NC_PIN_VALUE;
    obj->pin_rx_ws     = CYHAL_NC_PIN_VALUE;
    obj->pin_rx_sdi    = CYHAL_NC_PIN_VALUE;
    obj->pin_mclk      = CYHAL_NC_PIN_VALUE;

    obj->is_tx_slave    = config->is_tx_slave;
    obj->is_rx_slave    = config->is_rx_slave;
    obj->mclk_hz        = config->mclk_hz;
    obj->channel_length = config->channel_length;
    obj->word_length    = config->word_length;
    obj->sample_rate_hz = config->sample_rate_hz;

