aws/amazon-freertos/vendors/cypress/MTB/psoc6/psoc6csp/hal/COMPONENT_PSOC6HAL/source/cyhal_i2s.c
void cyhal_i2s_register_callback(cyhal_i2s_t *obj, cyhal_i2s_event_callback_t callback, void *callback_arg)
{
    CY_ASSERT(NULL != obj);

    uint32_t savedIntrStatus = cyhal_system_critical_section_enter();
    obj->callback_data.callback = (cy_israddress) callback;
    obj->callback_data.callback_arg = callback_arg;
    cyhal_system_critical_section_exit(savedIntrStatus);
}

void cyhal_i2s_enable_event(cyhal_i2s_t *obj, cyhal_i2s_event_t event, uint8_t intr_priority, bool enable)
{
    CY_ASSERT(NULL != obj);

    if (enable)
    {
        obj->user_enabled_events |= event;
    }
    else
    {
        obj->user_enabled_events &= ~event;
    }

    cyhal_i2s_update_enabled_events(obj);
    IRQn_Type irqn = cyhal_i2s_irq_n[obj->resource.block_num];
    NVIC_SetPriority(irqn, intr_priority);
}

cy_rslt_t cyhal_i2s_start_tx(cyhal_i2s_t *obj)
{
    if (obj->pm_transition_ready)
    {
        return CYHAL_SYSPM_RSLT_ERR_PM_PENDING;
    }
    Cy_I2S_EnableTx(obj->base);
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cyhal_i2s_stop_tx(cyhal_i2s_t *obj)
{
    Cy_I2S_DisableTx(obj->base);
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cyhal_i2s_start_rx(cyhal_i2s_t *obj)
{
    if (obj->pm_transition_ready)
    {
        return CYHAL_SYSPM_RSLT_ERR_PM_PENDING;
    }
    Cy_I2S_EnableRx(obj->base);
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cyhal_i2s_stop_rx(cyhal_i2s_t *obj)
{
    Cy_I2S_DisableRx(obj->base);
    return CY_RSLT_SUCCESS;
}

// Reads until empty, then updates the length and buffer address to their new locations
static void cyhal_i2s_read_until_empty(cyhal_i2s_t *obj, void** buffer, size_t* length)
{
    // The buffer is the smallest type that will hold the word length
    // The structure of this function deliberately accepts duplication of the outer loop
    // structure in order to avoid having to recheck the word length every time around,
    // because this function is in a performance sensitive code path.
    if(obj->word_length <= 8)
    {
        uint8_t *cast_buffer = (uint8_t*)(*buffer);

        while(*length > 0 && Cy_I2S_GetNumInRxFifo(obj->base) > 0)
        {
            *cast_buffer = (uint8_t)Cy_I2S_ReadRxData(obj->base);
            ++cast_buffer;
            --(*length);
        }
        *buffer = (void*)cast_buffer;
    }
    else if(obj->word_length <= 16)
    {
        uint16_t *cast_buffer = (uint16_t*)(*buffer);

        while(*length > 0 && Cy_I2S_GetNumInRxFifo(obj->base) > 0)
        {
            *cast_buffer = (uint8_t)Cy_I2S_ReadRxData(obj->base);
            ++cast_buffer;
            --(*length);
        }
        *buffer = (void*)cast_buffer;
    }
    else
    {
        CY_ASSERT(obj->word_length <= 32);
        uint32_t *cast_buffer = (uint32_t*)(*buffer);

        while(*length > 0 && Cy_I2S_GetNumInRxFifo(obj->base) > 0)
        {
            *cast_buffer = Cy_I2S_ReadRxData(obj->base);
            ++cast_buffer;
            --(*length);
        }
        *buffer = (void*)cast_buffer;
    }
}

cy_rslt_t cyhal_i2s_read(cyhal_i2s_t *obj, void *data, size_t* length)
{
    CY_ASSERT(NULL != obj);
    if (obj->pm_transition_ready)
    {
        return CYHAL_SYSPM_RSLT_ERR_PM_PENDING;
    }

    size_t remaining = *length;
    cyhal_i2s_read_until_empty(obj, &data, &remaining);
    *length -= remaining;
    return CY_RSLT_SUCCESS;
}

static void cyhal_i2s_write_until_full(cyhal_i2s_t *obj, const void** buffer, size_t *length)
{
    // The buffer is the smallest type that will hold the word length
    // The structure of this function deliberately accepts duplication of the outer loop
    // structure in order to avoid having to recheck the word length every time around,
    // because this function is in a performance sensitive code path.
    if(obj->word_length <= 8)
    {
        const uint8_t *cast_buffer = (const uint8_t*)(*buffer);

        while(*length > 0 && Cy_I2S_GetNumInTxFifo(obj->base) < CYHAL_I2S_FIFO_DEPTH)
        {
            Cy_I2S_WriteTxData(obj->base, *cast_buffer);
            ++cast_buffer;
            --(*length);
        }
        *buffer = (void*)cast_buffer;
    }
    else if(obj->word_length <= 16)
    {
        const uint16_t *cast_buffer = (const uint16_t*)(*buffer);

        while(*length > 0 && Cy_I2S_GetNumInTxFifo(obj->base) < CYHAL_I2S_FIFO_DEPTH)
        {
            Cy_I2S_WriteTxData(obj->base, *cast_buffer);
            ++cast_buffer;
            --(*length);
        }
        *buffer = (void*)cast_buffer;
    }
    else
    {
        CY_ASSERT(obj->word_length <= 32);
        const uint32_t *cast_buffer = (const uint32_t*)(*buffer);

        while(*length > 0 && Cy_I2S_GetNumInTxFifo(obj->base) < CYHAL_I2S_FIFO_DEPTH)
        {
            Cy_I2S_WriteTxData(obj->base, *cast_buffer);
            ++cast_buffer;
            --(*length);
        }
        *buffer = (void*)cast_buffer;
    }
}

cy_rslt_t cyhal_i2s_write(cyhal_i2s_t *obj, const void *data, size_t *length)
{
    CY_ASSERT(NULL != obj);
    if (obj->pm_transition_ready)
    {
        return CYHAL_SYSPM_RSLT_ERR_PM_PENDING;
    }

    size_t remaining = *length;
    cyhal_i2s_write_until_full(obj, &data, &remaining);
    *length -= remaining;
    return CY_RSLT_SUCCESS;
}

bool cyhal_i2s_is_tx_busy(cyhal_i2s_t *obj)
{
    CY_ASSERT(NULL != obj);

    return (0 != Cy_I2S_GetNumInTxFifo(obj->base)) || cyhal_i2s_is_write_pending(obj);
}

bool cyhal_i2s_is_rx_busy(cyhal_i2s_t *obj)
{
    CY_ASSERT(NULL != obj);

    return (0 != Cy_I2S_GetNumInRxFifo(obj->base)) || cyhal_i2s_is_read_pending(obj);
}

cy_rslt_t cyhal_i2s_read_async(cyhal_i2s_t *obj, void *rx, size_t rx_length)
{
    CY_ASSERT(NULL != obj);
    if (obj->pm_transition_ready)
    {
        return CYHAL_SYSPM_RSLT_ERR_PM_PENDING;
    }

    uint32_t savedIntrStatus = cyhal_system_critical_section_enter();
    obj->async_rx_buff = rx;
    obj->async_rx_length = rx_length;
    cyhal_system_critical_section_exit(savedIntrStatus);
    switch(obj->async_mode)
    {
        case CYHAL_ASYNC_SW:
        {
            /* Read as much as we can now, then set up an interrupt to do the rest
             * This is a potentially long operation but we don't want other I2S operations to
             * interleave with it. So do a "mini critical section" and disable the interrupts for this block only.
             */
            uint32_t old_interrupt_mask = Cy_I2S_GetInterruptMask(obj->base);
            Cy_I2S_SetInterruptMask(obj->base, 0u);
            cyhal_i2s_read_until_empty(obj, &obj->async_rx_buff, &obj->async_rx_length);
            Cy_I2S_SetInterruptMask(obj->base, old_interrupt_mask);
            if(obj->async_rx_length > 0)
            {
                cyhal_i2s_update_enabled_events(obj);
            }
            else
            {
                cyhal_i2s_update_enabled_events(obj);
                cyhal_i2s_process_event(obj, CYHAL_I2S_ASYNC_RX_COMPLETE);
            }
           break;
        }
        case CYHAL_ASYNC_DMA:
        {
            cyhal_i2s_dma_perform_rx(obj);
            break;
        }
        default:
           CY_ASSERT(0); /* Unrecognized async mode */
    }

    return CY_RSLT_SUCCESS;
}

static cy_rslt_t cyhal_i2s_populate_pdl_config(cyhal_i2s_t *obj, cy_stc_i2s_config_t* pdl_config, uint8_t sclk_div)
{
    cy_en_i2s_len_t pdl_word_length, pdl_channel_length;
    cy_rslt_t result = cyhal_i2s_convert_length(obj->channel_length, &pdl_channel_length);
    if (CY_RSLT_SUCCESS == result)
    {
        result = cyhal_i2s_convert_length(obj->word_length, &pdl_word_length);
    }

    if(CY_RSLT_SUCCESS == result)
    {
        *pdl_config = default_i2s_config;
        pdl_config->txEnabled = (CYHAL_NC_PIN_VALUE != obj->pin_tx_sdo);
        pdl_config->rxEnabled = (CYHAL_NC_PIN_VALUE != obj->pin_rx_sdi);
        pdl_config->extClk = (CYHAL_NC_PIN_VALUE != obj->pin_mclk);
        pdl_config->clkDiv = sclk_div;
        pdl_config->txMasterMode = !obj->is_tx_slave;
        pdl_config->rxMasterMode = !obj->is_rx_slave;
        pdl_config->rxChannelLength = pdl_channel_length;
        pdl_config->rxWordLength = pdl_word_length;
        pdl_config->txChannelLength = pdl_channel_length;
        pdl_config->txWordLength = pdl_word_length;
    }
    return result;
}

// Round up the word length to the next power of 2
static uint8_t cyhal_i2s_rounded_word_length(cyhal_i2s_t *obj)
{
    CY_ASSERT(obj->word_length <= 32);
    if(obj->word_length <= 8)
    {
        return 8u;
    }
    else if(obj->word_length <= 16)
    {
        return 16u;
    }

    return 32u;
}

