aws/amazon-freertos/vendors/cypress/MTB/psoc6/psoc6csp/hal/COMPONENT_PSOC6HAL/source/cyhal_i2s.c
    return pdl_event;
}

static cy_rslt_t cyhal_i2s_convert_length(uint8_t user_length, cy_en_i2s_len_t *pdl_length)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    switch(user_length)
    {
        case 8u:
            *pdl_length = CY_I2S_LEN8;
            break;
        case 16u:
            *pdl_length = CY_I2S_LEN16;
            break;
        case 18u:
            *pdl_length = CY_I2S_LEN18;
            break;
        case 20u:
            *pdl_length = CY_I2S_LEN20;
            break;
        case 24u:
            *pdl_length = CY_I2S_LEN24;
            break;
        case 32u:
            *pdl_length = CY_I2S_LEN32;
            break;
        default:
            result = CYHAL_I2S_RSLT_ERR_INVALID_ARG;
    }
    return result;
}

static void cyhal_i2s_irq_handler(void)
{
    IRQn_Type irqn = CYHAL_GET_CURRENT_IRQN();
    uint8_t block = cyhal_i2s_get_block_from_irqn(irqn);
    cyhal_i2s_t* obj = cyhal_i2s_config_structs[block];

    uint32_t interrupt_status = Cy_I2S_GetInterruptStatusMasked(obj->base);
    Cy_I2S_ClearInterrupt(obj->base, interrupt_status);
    cyhal_i2s_event_t event = cyhal_i2s_convert_interrupt_cause(interrupt_status);
    cyhal_i2s_process_event(obj, event);
}

static void cyhal_i2s_update_enabled_events(cyhal_i2s_t *obj)
{
    cyhal_i2s_event_t events = (cyhal_i2s_event_t)obj->user_enabled_events;
    if(CYHAL_ASYNC_SW == obj->async_mode)
    {
        if(NULL != obj->async_tx_buff)
        {
            events |= (CYHAL_I2S_TX_EMPTY | CYHAL_I2S_TX_HALF_EMPTY);
        }
        if(NULL != obj->async_rx_buff)
        {
            if(obj->async_rx_length >= (CYHAL_I2S_FIFO_DEPTH / 2))
            {
                events |= (CYHAL_I2S_RX_FULL | CYHAL_I2S_RX_HALF_FULL);
            }
            else if(obj->async_rx_length > 0)
            {
                /* At this point the half full interrupt won't fire until after we've received
                 * the remaining data, so switch to reading out each word as it comes in
                 */
                events |= CYHAL_I2S_RX_NOT_EMPTY;
            }
        }
    }

    uint32_t mask = cyhal_i2s_convert_event(events);
    // The register is 24 bits wide but the hardware pads the value out with 1's when read.
    // So mask down to just the bits that we actually care about.
    uint32_t old_mask = Cy_I2S_GetInterruptMask(obj->base) & CY_I2S_INTR_MASK;

    // Clear the interrupts that are about to be enabled to avoid spurious firing
    uint32_t new_interrupts = mask & (~old_mask);
    Cy_I2S_ClearInterrupt(obj->base, new_interrupts);

    Cy_I2S_SetInterruptMask(obj->base, mask);
}

static cy_rslt_t cyhal_i2s_dma_perform_rx(cyhal_i2s_t *obj)
{
    size_t transfer_size = CYHAL_I2S_DMA_BURST_SIZE;
    if (transfer_size >= obj->async_rx_length)
    {
        transfer_size = obj->async_rx_length;
        // Only want the user callback to be call on the last dma transfer.
        cyhal_dma_enable_event(&(obj->rx_dma), CYHAL_DMA_TRANSFER_COMPLETE, obj->async_dma_priority, true);
    }

    cyhal_dma_cfg_t dma_cfg =
    {
        .src_addr = (uint32_t)(&(obj->base->RX_FIFO_RD)),
        .src_increment = 0,
        .dst_addr = (uint32_t)obj->async_rx_buff,
        .dst_increment = 1,
        .transfer_width = cyhal_i2s_rounded_word_length(obj),
        .length = transfer_size,
        .burst_size = 0,
        .action = CYHAL_DMA_TRANSFER_FULL,
    };
    cy_rslt_t result = cyhal_dma_configure(&(obj->rx_dma), &dma_cfg);

    // Update the buffer first so that it's guaranteed to be correct whenever the DMA completes
    if(CY_RSLT_SUCCESS == result)
    {
        size_t increment_bytes = transfer_size * (cyhal_i2s_rounded_word_length(obj) / 8);
        uint32_t savedIntrStatus = cyhal_system_critical_section_enter();
        obj->async_rx_buff = (void*)(((uint8_t*) obj->async_rx_buff) + increment_bytes);
        obj->async_tx_length -= transfer_size;
        cyhal_system_critical_section_exit(savedIntrStatus);

        result = cyhal_dma_start_transfer(&(obj->rx_dma));
    }

    return result;
}

static cy_rslt_t cyhal_i2s_dma_perform_tx(cyhal_i2s_t *obj)
{
    size_t transfer_size = CYHAL_I2S_DMA_BURST_SIZE;
    if (transfer_size >= obj->async_tx_length)
    {
        transfer_size = obj->async_tx_length;
        // Only want the user callback to be call on the last dma transfer.
        cyhal_dma_enable_event(&(obj->tx_dma), CYHAL_DMA_TRANSFER_COMPLETE, obj->async_dma_priority, true);
    }

    cyhal_dma_cfg_t dma_cfg =
    {
        .src_addr = (uint32_t)obj->async_tx_buff,
        .src_increment = 1,
        .dst_addr = (uint32_t)(&(obj->base->TX_FIFO_WR)),
        .dst_increment = 0,
        .transfer_width = cyhal_i2s_rounded_word_length(obj),
        .length = transfer_size,
        .burst_size = 0,
        .action = CYHAL_DMA_TRANSFER_FULL,
    };
    cy_rslt_t result = cyhal_dma_configure(&(obj->tx_dma), &dma_cfg);

    // Update the buffer first so that it's guaranteed to be correct whenever the DMA completes
    if(CY_RSLT_SUCCESS == result)
    {
        size_t increment_bytes = transfer_size * (cyhal_i2s_rounded_word_length(obj) / 8);
        uint32_t savedIntrStatus = cyhal_system_critical_section_enter();
        obj->async_tx_buff = (void*)(((uint8_t*) obj->async_tx_buff) + increment_bytes);
        obj->async_tx_length -= transfer_size;
        cyhal_system_critical_section_exit(savedIntrStatus);

        result = cyhal_dma_start_transfer(&(obj->tx_dma));
    }

    return result;
}

/* Callback argument is the I2S instance */
static void cyhal_i2s_dma_handler_rx(void *callback_arg, cyhal_dma_event_t event)
{
    /* We only hook this handler up when we're doing the final transfer, so send the completed event */
    CY_ASSERT(CYHAL_DMA_TRANSFER_COMPLETE == event);

    cyhal_i2s_t *obj = (cyhal_i2s_t*)callback_arg;
    obj->async_rx_buff = NULL;
    cyhal_dma_enable_event(&obj->rx_dma, CYHAL_DMA_TRANSFER_COMPLETE, obj->async_dma_priority, false);
    cyhal_i2s_process_event(obj, CYHAL_I2S_ASYNC_RX_COMPLETE);
}

/* Callback argument is the I2S instance */
static void cyhal_i2s_dma_handler_tx(void *callback_arg, cyhal_dma_event_t event)
{
    /* We only hook this handler up when we're doing the final transfer, so send the completed event */
    CY_ASSERT(CYHAL_DMA_TRANSFER_COMPLETE == event);

    cyhal_i2s_t *obj = (cyhal_i2s_t*)callback_arg;
    obj->async_tx_buff = NULL;
    cyhal_dma_enable_event(&obj->tx_dma, CYHAL_DMA_TRANSFER_COMPLETE, obj->async_dma_priority, false);
    cyhal_i2s_process_event(obj, CYHAL_I2S_ASYNC_TX_COMPLETE);
}

